app/controllers/clientes_controller.rb

  def store
    conditions = ""
    conditions =["nome LIKE ? OR codigo LIKE ?", "%#{params[:query]}%", "%#{params[:query]}%"] if params[:query].present?
    clientes = Cliente.all(
        :conditions => conditions,
        :limit => params[:limit],
        :offset => params[:start],
        :order => "nome"
    )
    total = Cliente.count(:conditions => conditions)
---
SELECT * FROM "clientes" ORDER BY nome LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "clientes"

  def index
    @clientes = Cliente.all
---
SELECT * FROM "clientes"

  def show
    @cliente = Cliente.find(params[:id])
---
SELECT * FROM "clientes" WHERE ("clientes"."id" = 1)

  def edit
    @cliente = Cliente.find(params[:id])
---
SELECT * FROM "clientes" WHERE ("clientes"."id" = 1)

  def create
    @cliente = Cliente.new(params[:cliente])
    respond_to do |format|
      if @cliente.save
---
INSERT INTO "clientes" ("endereco", "created_at", "tel1", "nome", "razao", "contato", "tel2", "updated_at", "cnpj", "fax", "site", "bairro", "pais", "estado", "cidade", "email") VALUES('aaa', '2012-02-08 11:03:27.933955', 1212, 'Cliente 1', 'Qualquer', '', 1212, '2012-02-08 11:03:27.933955', '321212312', 1212, 'aa', 'aa', 'aaa', 'aa', 'aa', 'aa') RETURNING "id"

  def update
    @cliente = Cliente.find(params[:id])

    respond_to do |format|
      if @cliente.update_attributes(params[:cliente])
---
SELECT * FROM "clientes" WHERE ("clientes"."id" = 1)
UPDATE "clientes" SET "updated_at" = '2012-02-08 11:31:56.905777', "tel2" = 24, "email" = 'xx', "tel1" = 24, "endereco" = 'aaaxx', "razao" = 'Qualquerx', "pais" = 'aaaxx', "estado" = 'aaxx', "site" = 'aaxx', "cnpj" = '321212312x', "bairro" = 'aaxx', "fax" = 24, "nome" = 'Cliente 1x', "cidade" = 'aaxx' WHERE "id" = 1