app/controllers/equipamentos_controller.rb

  def store
    conditions = ""
    conditions =["nome LIKE ? OR codigo LIKE ?", "%#{params[:query]}%", "%#{params[:query]}%"] if params[:query].present?
    equipamentos = Equipamento.all(
        :conditions => conditions,
        :limit => params[:limit],
        :offset => params[:start],
        :order => "modelo"
    )
    total = Equipamento.count(:conditions => conditions)
---
SELECT * FROM "equipamentos" ORDER BY modelo LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "equipamentos"

  def index
    @equipamentos = Equipamento.all
---
SELECT * FROM "equipamentos"

  def show
    @equipamento = Equipamento.find(params[:id])
---
SELECT * FROM "equipamentos" WHERE ("equipamentos"."id" = 1)

  def edit
    @equipamento = Equipamento.find(params[:id])
---
SELECT * FROM "equipamentos" WHERE ("equipamentos"."id" = 1)

  def create
    @equipamento = Equipamento.new(params[:equipamento])
    respond_to do |format|
      if @equipamento.save
---
INSERT INTO "equipamentos" ("tipo", "created_at", "updated_at", "horas_dia", "codigo", "serie", "modelo", "operacao_id") VALUES('Pequeno', '2012-02-20 12:22:42.555058', '2012-02-20 12:22:42.555058', 30.0, 'Torno 300 - 1', '54s65d87', 'ROMI', 1) RETURNING "id"

  def update
    @equipamento = Equipamento.find(params[:id])

    respond_to do |format|
      if @equipamento.update_attributes(params[:equipamento])
---
SELECT * FROM "equipamentos" WHERE ("equipamentos"."id" = 1)
UPDATE "equipamentos" SET "codigo" = '001xxx', "updated_at" = '2012-02-10 10:44:53.543906', "tipo" = 'Mediçãoxxx', "horas_dia" = 24.0, "modelo" = 'Paquimetroxxx', "serie" = '021546548xxx' WHERE "id" = 1

  def destroy
    @equipamento = Equipamento.find(params[:id])
    respond_to do |format|
      if @equipamento.destroy
---
SELECT * FROM "equipamentos" WHERE ("equipamentos"."id" = 1)
DELETE FROM "equipamentos" WHERE "id" = 1