app/controllers/funcionarios_controller.rb

  def store
    conditions = ""
    conditions =["nome LIKE ? OR codigo LIKE ?", "%#{params[:query]}%", "%#{params[:query]}%"] if params[:query].present?
    funcionarios = Funcionario.all(
        :conditions => conditions,
        :limit => params[:limit],
        :offset => params[:start],
        :order => "nome"
    )
    total = Funcionario.count(:conditions => conditions)
---
SELECT * FROM "funcionarios" ORDER BY nome LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "funcionarios"

  def index
    @funcionarios = Funcionario.all
---
SELECT * FROM "funcionarios"

  def show
    @funcionario = Funcionario.find(params[:id])
---
SELECT * FROM "funcionarios" WHERE ("funcionarios"."id" = 1)

  def edit
    @funcionario = Funcionario.find(params[:id])
---
SELECT * FROM "funcionarios" WHERE ("funcionarios"."id" = 1)

  def create
    @funcionario = Funcionario.new(params[:funcionario])
    file = params[:foto]
    if file
      file.configure(FileClassification::IMAGES::config)
      if file.is_valid?
        if @funcionario.save
          file.file_name = "#{@funcionario.id.to_s}_#{file.original_filename}"
          params[:funcionario]['foto'] = file.file_name
          if file.save
---
INSERT INTO "funcionarios" ("endereco", "created_at", "nome", "cpf", "cep", "updated_at", "tel", "setor", "bairro", "cidade", "estado", "turno", "rg", "cel") VALUES('Rua', '2012-02-08 16:41:36.566418', 'Ronaldo', '123', 12222, '2012-02-08 16:41:36.566418', 12, 'Engenharia', 'CC', 'Indaia', 'SP', '1', '123', 21) RETURNING "id"
UPDATE "funcionarios" SET "updated_at" = '2012-02-09 17:31:41.188978', "foto" = '5_IMGP2816.JPG' WHERE "id" = 5

  def update
    @funcionario = Funcionario.find(params[:id])

    respond_to do |format|
      if @funcionario.update_attributes(params[:funcionario])
---
SELECT * FROM "funcionarios" WHERE ("funcionarios"."id" = 1)
UPDATE "funcionarios" SET "updated_at" = '2012-02-08 16:47:23.689423', "cpf" = '123111111', "endereco" = 'Ruaxx', "rg" = '123x', "cel" = 211111111, "setor" = 'Engenhariax', "estado" = 'SPx', "turno" = '1x', "bairro" = 'CCx', "nome" = 'Ronaldox', "cidade" = 'Indaiax' WHERE "id" = 1

  def destroy
    @funcionario = Funcionario.find(params[:id])
    respond_to do |format|
      if @funcionario.destroy
---
SELECT * FROM "funcionarios" WHERE ("funcionarios"."id" = 3)
DELETE FROM "funcionarios" WHERE "id" = 3