app/controllers/login_controller.rb

  def index
    @user = User.find(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1