app/controllers/ordems_controller.rb

SELECT * FROM "ordems" ORDER BY data_prevista ASC
SELECT * FROM "equipamentos"
---
  def planejamento
    @ordems = Ordem.all(:order => "data_prevista ASC")
    @equipamentos = Equipamento.all

SELECT * FROM "ordems" ORDER BY data_prevista LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "ordems"
---
  def store
    list = []
    conditions = ""
    conditions =["nome LIKE ? OR titulo LIKE ?", "%#{params[:query]}%", "%#{params[:query]}%"] if params[:query].present?
    ordems = Ordem.all(
        :conditions => conditions,
        :limit => params[:limit],
        :offset => params[:start],
        :order => "data_prevista"
    )
    ordems.each do |o|
      list <<
      {
        :id => o.id,
        :titulo => o.titulo,
        :cliente_nome => o.cliente.nome,
        :produto_nome => o.produto.nome,
        :qtde => o.qtde,
        :data => o.created_at,
        :data_prevista => o.data_prevista
      }
    end
    total = Ordem.count(:conditions => conditions)

SELECT * FROM "ordems"
---
  def index
    @ordems = Ordem.all

SELECT * FROM "ordems" WHERE ("ordems"."id" = 1)
SELECT * FROM "equipamentos"
---
  def show
    @ordem = Ordem.find(params[:id])
    equipamentos = Equipamento.all

SELECT * FROM "ordems" WHERE ("ordems"."id" = 1)
---
  def edit
    @ordem = Ordem.find(params[:id])

INSERT INTO "ordems" ("produto_id", "created_at", "data_prevista", "titulo", "updated_at", "cliente_id", "qtde") VALUES(1, '2012-02-10 15:08:06.116978', '2012-02-10', 'Qualquer', '2012-02-10 15:08:06.116978', 1, 10) RETURNING "id"
---
  def create
    @ordem = Ordem.new(params[:ordem])
    respond_to do |format|
      if @ordem.save

SELECT * FROM "ordems" WHERE ("ordems"."id" = 6)
DELETE FROM "ordems" WHERE "id" = 6
---
  def destroy
    @ordem = Ordem.find(params[:id])
    respond_to do |format|
      if @ordem.destroy