app/controllers/processos_controller.rb

  def store
    conditions = ""
    conditions =["nome LIKE ? OR codigo LIKE ?", "%#{params[:query]}%", "%#{params[:query]}%"] if params[:query].present?
    processos = Processo.all(
        :conditions => conditions,
        :limit => params[:limit],
        :offset => params[:start],
        :order => "nome"
    )
    total = Processo.count(:conditions => conditions)
---
SELECT * FROM "processos" WHERE (nome LIKE '%torn%' OR codigo LIKE '%torn%') ORDER BY nome
SELECT count(*) AS count_all FROM "processos" WHERE (nome LIKE '%torn%' OR codigo LIKE '%torn%')

  def index
    @processos = Processo.all
---
SELECT * FROM "processos"

  def show
    @processo = Processo.find(params[:id])
---
SELECT * FROM "processos" WHERE ("processos"."id" = 1)

  def edit
    @processo = Processo.find(params[:id])
---
SELECT * FROM "processos" WHERE ("processos"."id" = 1)

  def create
    @processo = Processo.new(params[:processo])
    respond_to do |format|
      if @processo.save
---
INSERT INTO "processos" ("created_at", "nome", "updated_at", "codigo", "descricao") VALUES('2011-11-30 12:54:51.675137', 'Tornear', '2011-11-30 12:54:51.675137', 'TR01', 'Primeira Fase do Torneamento') RETURNING "id"

  def update
    @processo = Processo.find(params[:id])

    respond_to do |format|
      if @processo.update_attributes(params[:processo])
---
SELECT * FROM "processos" WHERE ("processos"."id" = 1)
UPDATE "processos" SET "codigo" = 'aaax', "updated_at" = '2012-02-10 11:46:43.727545', "tipo" = 'aaax', "descricao" = 'aaax', "nome" = 'aaax' WHERE "id" = 7

  def destroy
    @processo = Processo.find(params[:id])
    respond_to do |format|
      if @processo.destroy
---
SELECT * FROM "processos" WHERE ("processos"."id" = 2)
DELETE FROM "processos" WHERE "id" = 2