app/controllers/produtos_controller.rb

SELECT * FROM "produtos" ORDER BY nome LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "produtos"
---
  def store
    conditions = ""
    conditions =["nome LIKE ? OR codigo LIKE ?", "%#{params[:query]}%", "%#{params[:query]}%"] if params[:query].present?
    produtos = Produto.all(
        :conditions => conditions,
        :limit => params[:limit],
        :offset => params[:start],
        :order => "nome"
    )
    total = Produto.count(:conditions => conditions)

SELECT * FROM "produtos"
---
  def index
    @produtos = Produto.all

SELECT * FROM "produtos" WHERE ("produtos"."id" = 1)
---
  def show
    @produto = Produto.find(params[:id])

SELECT * FROM "produtos" WHERE ("produtos"."id" = 2)
---
  def edit
    @produto = Produto.find(params[:id])

INSERT INTO "produtos" ("created_at", "nome", "updated_at", "codigo", "detalhes", "descricao") VALUES('2011-11-30 11:37:01.555398', 'Aruela Padrão', '2011-11-30 11:37:01.555398', 'ARR001', 'Estampada', 'Arruela para aplicação em geral 5x8') RETURNING "id"
---
  def create
    @produto = Produto.new(params[:produto])
    respond_to do |format|
      if @produto.save

SELECT * FROM "produtos" WHERE ("produtos"."id" = 1)
UPDATE "produtos" SET "updated_at" = '2011-11-30 11:45:25.681580', "nome" = 'Engrenagem de Aço' WHERE "id" = 1
---
  def update
    @produto = Produto.find(params[:id])

    respond_to do |format|
      if @produto.update_attributes(params[:produto])

SELECT * FROM "produtos" WHERE ("produtos"."id" = 3)
DELETE FROM "produtos" WHERE "id" = 3
---
  def destroy
    @produto = Produto.find(params[:id])
    respond_to do |format|
      if @produto.destroy