app/controllers/produto_processos_controller.rb

SELECT * FROM "produtos" ORDER BY nome LIMIT 10 OFFSET 0
SELECT * FROM "produto_processos" WHERE (produto_id = 1) ORDER BY created_at DESC LIMIT 1
SELECT count(*) AS count_all FROM "produto_processos" WHERE ("produto_processos".produto_id = 2)
SELECT * FROM "produto_processos" ORDER BY id DESC LIMIT 10 OFFSET 0
---
  def store
    lista = []
    count = 0
    conditions = ""
    conditions =["nome LIKE ? OR codigo LIKE ?", "%#{params[:query]}%", "%#{params[:query]}%"] if params[:query].present?
    produtos = Produto.all(
        :conditions => conditions,
        :limit => params[:limit],
        :offset => params[:start],
        :order => "nome"
    )
    produtos.each do |p|
      if p.produto_processos.size > 0
        count += 1
        lista <<
        {
          :id => p.id,
          :produto => p.nome,
          :processos => p.produto_processos.size,
          :atualizado => ProdutoProcesso.last(:conditions => ["produto_id = ?", p.id], :order => "created_at ASC").created_at.strftime("%d/%m/%Y - %H:%M:%S")

SELECT * FROM "produto_processos"
---
  def index
    @produto_processos = ProdutoProcesso.all

SELECT * FROM "produto_processos" WHERE ("produto_processos"."id" = 1)
---
  def show
    @produto_processo = ProdutoProcesso.find(params[:id])

SELECT * FROM "produto_processos" WHERE ("produto_processos"."id" = 3)
---
  def edit
    @produto_processo = ProdutoProcesso.find(params[:id])

SELECT * FROM "produtos" WHERE ("produtos"."id" = 1)
INSERT INTO "produto_processos" ("produto_id", "created_at", "updated_at", "producao_hora", "processo_id", "tempo_padrao") VALUES(1, '2012-01-03 09:47:21.475577', '2012-01-03 09:47:21.475577', NULL, NULL, NULL) RETURNING "id"
---
  def create
    processos = ActiveSupport::JSON.decode(params[:produto_processos]) if params[:produto_processos]
    respond_to do |format|
      if processos
        produto = Produto.find(params[:produto_processo]["produto_id"]) if params[:produto_processo]
        processos.each do |p|
          processo = ProdutoProcesso.create(:produto_id => produto.id, :processo_id => p["id"], :tempo_padrao => p["tempo_padrao"], :producao_hora => p["producao_hora"])