app/controllers/users_controller.rb

  def store
      list = []
      conditions = ""
      conditions =
      [
        "login LIKE ? OR name LIKE ? OR email LIKE ? ",
        "%#{params[:query]}%", "%#{params[:query]}%", "%#{params[:query]}%"
      ] if params[:query]

      users = User.all(
        :conditions => conditions,
        :limit => params[:limit],
        :offset => params[:start],
        :order => "name"
      )
      total = User.count(:conditions => conditions)
---
SELECT * FROM "users" ORDER BY name LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "users"

  def create
    @user = User.new(params[:user])
    if request.post? and @user.save
---
INSERT INTO "users" ("name", "salt", "created_at", "notes", "updated_at", "hashed_password", "phone", "login", "email", "active") VALUES('Ronaldo', '-6165868880.349502230102255', '2011-11-30 11:15:32.196239', '', '2011-11-30 11:15:32.196239', '29ca0d82d44e9245de660c6791318b5d478cc155', '123', 'ronaldo', 'ronaldo@roro.com', NULL) RETURNING "id"

  def update
    @user = User.find(params[:id])
    session[:user_being_edited] = @user.id
    if request.post?
      if not params[:change_password]
        params[:user][:password] = nil
        params[:user][:password_confirmation] = nil
      end
      if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
UPDATE "users" SET "phone" = '123', "updated_at" = '2011-11-30 11:14:30.132032', "salt" = '-6165233880.83459421742358', "hashed_password" = 'f889c18c267aa6930578a6c4184eb7edbbb3f11f' WHERE "id" = 1

  def destroy
    @user = User.find(params[:id])
    respond_to do |format|
      if @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 1)
DELETE FROM "users" WHERE "id" = 1